---
kind: method
id: M:Autodesk.Revit.DB.MEPCalculationServerInfo.GetMEPCalculationServerInfo(Autodesk.Revit.DB.FamilyInstance)
source: html/bd5660a9-50df-169b-0e67-0806aeeb6944.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.GetMEPCalculationServerInfo Method

Gets a MEPCalculationServerInfo by family instance.

## Syntax (C#)
```csharp
public static MEPCalculationServerInfo GetMEPCalculationServerInfo(
	FamilyInstance famInst
)
```

## Parameters
- **famInst** (`Autodesk.Revit.DB.FamilyInstance`) - The family instance.

## Returns
The MEPCalculationServerInfo.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null